app/views/teams/show.html.haml

%ul.list-group
  - @team.members.compact.each do |member|
---
SELECT "members".* FROM "members" INNER JOIN "shifts" ON "members"."id" = "shifts"."member_id" WHERE "shifts"."team_id" = ?  [["team_id", 31]]