app/views/shifts/_form.html.haml

SELECT "teams".* FROM "teams" ORDER BY "teams"."team_name" ASC
---
      .input-group.form-group
        = f.collection_select :team_id, Team.order(:team_name), :id, :team_name,{:prompt => "Select a Team        "}, {:class=>"team-selection form-control",required: true}
  .form-group

SELECT "members".* FROM "members" ORDER BY "members"."name" ASC
---
      .input-group.form-group
        = f.collection_select :member_id, Member.order(:name), :id, :name, {:prompt => "Select a Member"}, {:class=>"member-selection form-control"}
  .form-group