app/views/shifts/_form.html.erb

    <div class="input-group form-group">
		<%= f.collection_select :team_id, Team.order(:team_name), :id, :team_name,{:prompt => "Select a Team"}, {:class=>"team-selection form-control",required: true} %>
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."team_name" ASC