app/controllers/shifts_controller.rb

  def index
    @shifts = Shift.where.not(time: nil)
---
SELECT  "shifts".* FROM "shifts" ORDER BY "shifts"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def new

    @shift = Shift.new
    @members = Member.order(:name)
---
SELECT "members".* FROM "members" ORDER BY "members"."name" ASC

  def edit
    @members = Team.find_by_id(@shift.team_id).members
---
SELECT "members".* FROM "members" INNER JOIN "shifts" ON "members"."id" = "shifts"."member_id" WHERE "shifts"."team_id" = ?  [["team_id", 30]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]

  def get_members
    @members = Team.find_by_id(params[:id]).members
---
SELECT "members".* FROM "members" INNER JOIN "shifts" ON "members"."id" = "shifts"."member_id" WHERE "shifts"."team_id" = ?  [["team_id", 29]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]

  def create
    @shift = Shift.new(shift_params)

    respond_to do |format|
      if @shift.save
---
INSERT INTO "shifts" ("monday", "thrusday", "time", "member_id", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["monday", 1], ["thrusday", 1], ["time", "2000-01-01 21:13:00"], ["member_id", 30], ["team_id", 25], ["created_at", "2021-02-27 21:13:33.838668"], ["updated_at", "2021-02-27 21:13:33.838668"]]

  def updatea
    respond_to do |format|
      if @shift.update(shift_params)
---
UPDATE "shifts" SET "time" = ?, "updated_at" = ? WHERE "shifts"."id" = ?  [["time", "2000-01-01 21:14:00"], ["updated_at", "2021-02-27 21:14:49.215772"], ["id", 38]]

  def destroy
    @shift.destroy
---
DELETE FROM "shifts" WHERE "shifts"."id" = ?  [["id", 37]]

    def set_shift
      @shift = Shift.find(params[:id])
---
SELECT  "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]