app/controllers/teams_controller.rb

INSERT INTO "teams" ("team_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["team_name", "Team1"], ["created_at", "2021-02-26 22:18:20.159159"], ["updated_at", "2021-02-26 22:18:20.159159"]]
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save

UPDATE "teams" SET "team_name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["team_name", "Team2"], ["updated_at", "2021-02-26 22:19:11.723777"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @team.update(team_params)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 6]]
---
  def destroy
    @team = Team.find_by_id(params[:id])
    @team.destroy

SELECT  DISTINCT "teams"."id" FROM "teams" LEFT OUTER JOIN "shifts" ON "shifts"."team_id" = "teams"."id" LEFT OUTER JOIN "shifts" "shifts_teams_join" ON "shifts_teams_join"."team_id" = "teams"."id" LEFT OUTER JOIN "members" ON "members"."id" = "shifts_teams_join"."member_id" WHERE "members"."team_id" = ? ORDER BY "teams"."id" ASC LIMIT ?  [["team_id", "8"], ["LIMIT", 1]]
---
    def set_team
  #    @team = Team.find(params[:id])
      @team = Team.includes(:shifts).where(shifts: {team_id: params[:id]}).first